blog/2022/github-code-search.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 10:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>GitHub Code Search 搜索语法</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">GitHub Code Search 搜索语法</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0cb5019">1. 基础查询结构</a></li>
<li><a href="#org052e8ea">2. 精确查找</a></li>
<li><a href="#orgeb94621">3. 仓库和组织限定词</a></li>
<li><a href="#org5ab37d9">4. 语言限定</a></li>
<li><a href="#orgd6b2a2a">5. 路径限定</a></li>
<li><a href="#orgab6ecf0">6. 扩展名限定</a></li>
<li><a href="#org6b9204e">7. Symbol 限定</a></li>
<li><a href="#orgf5e7404">8. Content 限定</a></li>
</ul>
</div>
</nav>
<p>
<a href="https://cs.github.com/about/syntax">https://cs.github.com/about/syntax</a>
</p>

<div id="outline-container-org0cb5019" class="outline-2">
<h2 id="org0cb5019"><span class="section-number-2">1</span> 基础查询结构</h2>
<div class="outline-text-2" id="text-1">
<p>
一个关键词会匹配文件内容或文件路径。
</p>

<p>
多个关键词会匹配文件内容，只要包含关键词，就会出现在搜索结果中，不论前后顺序，是否是一个单词（多个关键词之间没有空格）。
</p>

<p>
还可以使用特定关键字（限定词）指定查询范围：
</p>

<ul class="org-ul">
<li>repo:github/github</li>
<li>org:github 或者 user:tj</li>
<li>language:python</li>
<li>path:README.md</li>
<li>extension:js</li>
<li>symbol:scanbytes</li>
<li>content:querystats</li>
</ul>

<p>
还支持逻辑运算符：
</p>

<ul class="org-ul">
<li>hello world &lt;=&gt; hello AND world</li>
<li>hello OR world</li>
<li>hello NOT world</li>
<li>"fatal error" NOT path:__testing__</li>
<li>(language:ruby OR language:python) AND NOT path:"<i>tests</i>"</li>
</ul>

<p>
还支持正则表达式，要用 // 包围：
</p>

<p>
\/git.*push\/
</p>

<p>
会查询所有文件中，git 后面有 push 的部分。git 与 push 之间可以有任意字符。
</p>
</div>
</div>

<div id="outline-container-org052e8ea" class="outline-2">
<h2 id="org052e8ea"><span class="section-number-2">2</span> 精确查找</h2>
<div class="outline-text-2" id="text-2">
<p>
目标词组要用 "" 包裹 "abc def"。
</p>

<p>
如果待搜索的字符串中有引号，可以用反斜杠转义 "name = \"Jim\""。
</p>

<p>
也支持限定词 path:git language:"protocol buffers"。
</p>
</div>
</div>

<div id="outline-container-orgeb94621" class="outline-2">
<h2 id="orgeb94621"><span class="section-number-2">3</span> 仓库和组织限定词</h2>
<div class="outline-text-2" id="text-3">
<p>
repo:github/linguist
</p>

<p>
repo:torvalds/linux OR repo:git/git
</p>

<p>
org:github &lt;=&gt; user:github
</p>

<p>
目前（2022-01-11）还不支持对仓库名和组织名、用户名的正则表达式全部或部分匹配，所以搜索时，需要输入目标的全部 user[org]/reponame。
</p>
</div>
</div>

<div id="outline-container-org5ab37d9" class="outline-2">
<h2 id="org5ab37d9"><span class="section-number-2">4</span> 语言限定</h2>
<div class="outline-text-2" id="text-4">
<p>
language:ruby OR language:cpp OR language:csharp
</p>

<p>
所有语言都在<a href="https://github.com/github/linguist/blob/master/lib/linguist/languages.yml">这里</a>。
</p>
</div>
</div>

<div id="outline-container-orgd6b2a2a" class="outline-2">
<h2 id="orgd6b2a2a"><span class="section-number-2">5</span> 路径限定</h2>
<div class="outline-text-2" id="text-5">
<p>
path:unit_tests
</p>

<p>
它会查找所有路径中包含目标的部分。
</p>

<p>
如果只想得到根路径下的内容，用正则表达式：
</p>

<div class="org-src-container">
<pre class="src src-text">path:/(^|\\/)/README\.md$/
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab6ecf0" class="outline-2">
<h2 id="orgab6ecf0"><span class="section-number-2">6</span> 扩展名限定</h2>
<div class="outline-text-2" id="text-6">
<p>
extension:.js &lt;=&gt; extension:js
</p>

<p>
extension:/[jt]s/
</p>

<p>
查找扩展名为 js 或 ts 的文件。
</p>
</div>
</div>

<div id="outline-container-org6b9204e" class="outline-2">
<h2 id="org6b9204e"><span class="section-number-2">7</span> Symbol 限定</h2>
<div class="outline-text-2" id="text-7">
<p>
language:go symbol:WithContext
</p>

<p>
目前（2022-01-11）只能查找关于 Symbol 的定义，还没有支持所有 Symbol 或语言。关于语言支持 Symbol 搜索的情况可以看 <a href="https://cs.github.com/about/faq#languages">FAQ</a>。
</p>

<p>
同样可以用正则表达式搜索：
</p>

<p>
language:rust symbol:/^String::to_.*/
</p>
</div>
</div>

<div id="outline-container-orgf5e7404" class="outline-2">
<h2 id="orgf5e7404"><span class="section-number-2">8</span> Content 限定</h2>
<div class="outline-text-2" id="text-8">
<p>
如果只想搜索内容，不包括文件路径，可以这样
</p>

<p>
content:README.md
</p>

<p>
它只匹配文件内容中，含有 README.md 的部分。</p>
</div>
</div>
</div>
</body>
</html>